Repository: alesdrobysh/purecal
Catalog: lib/l10n/app_*.arb
Languages: be, pl

source: Set Goals
be: Усталяваць мэты
pl: Ustaw cele

source: View Charts
be: Паглядзець графікі
pl: Pokaż wykresy

source: Settings
be: Налады
pl: Ustawienia

source: Search Products
be: Пошук прадуктаў
pl: Szukaj produktów

source: Nutrition Charts
be: Графікі харчавання
pl: Wykresy odżywcze

source: Set Your Goals
be: Усталюйце свае мэты
pl: Ustaw swoje cele

source: Scan Barcode
be: Сканаваць штрых-код
pl: Skanuj kod kreskowy

source: My Products
be: Мае прадукты
pl: Moje produkty

source: Manage your custom products
be: Кіраванне вашымі карыстальніцкімі прадуктамі
pl: Zarządzaj swoimi własnymi produktami

source: Quick Add
be: Хуткае даданне
pl: Szybkie dodawanie

source: Create Product
be: Стварыць прадукт
pl: Utwórz produkt

source: Edit Product
be: Рэдагаваць прадукт
pl: Edytuj produkt

source: Breakfast
be: Сняданак
pl: Śniadanie

source: Lunch
be: Абед
pl: Obiad

source: Dinner
be: Вячэра
pl: Kolacja

source: Snacks
be: Перакус
pl: Przekąski

# addToMeal
source: Add to {mealType}
be: Дадаць да {mealType}
pl: Dodaj do {mealType}

# scanForMeal
source: Scan for {mealType}
be: Сканаваць для {mealType}
pl: Skanuj dla {mealType}

# noItemsForMeal
source: No items for {mealType} yet
be: Пакуль няма элементаў для {mealType}
pl: Brak elementów dla {mealType}

source: Summary
be: Зводка
pl: Podsumowanie

source: Calories
be: Калорыі
pl: Kalorie

source: Protein
be: Бялкі
pl: Białko

source: Fat
be: Тлушчы
pl: Tłuszcze

source: Carbs
be: Вугляводы
pl: Węglowodany

source: Carbohydrates
be: Вугляводы
pl: Węglowodany

# macrosSummary
source: {protein}g P / {fat}g F / {carbs}g C
be: {protein}г Б / {fat}г Т / {carbs}г В
pl: {protein}g B / {fat}g T / {carbs}g W

source: Nutrition per 100g:
be: Харчаванне на 100г:
pl: Wartości odżywcze na 100g:

source: Your portion:
be: Ваша порцыя:
pl: Twoja porcja:

source: Goal Achievement
be: Дасягненне мэтаў
pl: Osiągnięcie celów

source: Daily Nutrition Goals
be: Штодзённыя мэты харчавання
pl: Dzienne cele żywieniowe

# setDailyTargets
source: Set your daily targets for calories and macronutrients
be: Усталюйце штодзённыя мэты па калорыях і макранутрыентах
pl: Ustaw swoje dzienne cele dotyczące kalorii i makroskładników

source: Actual
be: Фактычна
pl: Rzeczywiste

source: Goal
be: Мэта
pl: Cel

source: Add
be: Дадаць
pl: Dodaj

source: Cancel
be: Адмяніць
pl: Anuluj

source: Save
be: Захаваць
pl: Zapisz

source: Delete
be: Выдаліць
pl: Usuń

source: Edit
be: Рэдагаваць
pl: Edytuj

source: Retry
be: Паўтарыць
pl: Ponów

source: Clear
be: Ачысціць
pl: Wyczyść

source: Save Goals
be: Захаваць мэты
pl: Zapisz cele

# createProductButton
source: Create Product
be: Стварыць прадукт
pl: Utwórz produkt

source: Update Product
be: Абнавіць прадукт
pl: Zaktualizuj produkt

source: Add to Diary
be: Дадаць у дзённік
pl: Dodaj do dziennika

# tapPlusToAdd
source: Tap the + button to add
be: Націсніце кнопку + каб дадаць
pl: Dotknij przycisku + aby dodać

# searchProductsHint
source: Search products...
be: Пошук прадуктаў...
pl: Szukaj produktów...

source: Searching...
be: Пошук...
pl: Szukanie...

# searchForProducts
source: Search for products by name
be: Пошук прадуктаў па назве
pl: Szukaj produktów po nazwie

# searchExamples
source: Try "yogurt", "bread", "apple"...
be: Паспрабуйце "ёгурт", "хлеб", "яблык"...
pl: Spróbuj "jogurt", "chleb", "jabłko"...

source: No products found
be: Прадукты не знойдзены
pl: Nie znaleziono produktów

source: Frequently Used
be: Часта выкарыстоўваюцца
pl: Często używane

source: Product not found
be: Прадукт не знойдзены
pl: Produkt nie znaleziony

source: No custom products yet
be: Пакуль няма карыстальніцкіх прадуктаў
pl: Brak jeszcze własnych produktów

source: Product Name
be: Назва прадукту
pl: Nazwa produktu

# productNameRequired
source: Product Name *
be: Назва прадукту *
pl: Nazwa produktu *

source: Brand
be: Брэнд
pl: Marka

source: Barcode (optional)
be: Штрых-код (неабавязкова)
pl: Kod kreskowy (opcjonalnie)

source: Portion Size
be: Памер порцыі
pl: Rozmiar porcji

# gramsUnit
source: grams
be: грамы
pl: gramy

# typicalServingSize
source: Typical Serving Size (g)
be: Тыповы памер порцыі (г)
pl: Typowy rozmiar porcji (g)

# pleaseEnterProductName
source: Please enter a product name
be: Калі ласка, увядзіце назву прадукту
pl: Proszę podać nazwę produktu

# pleaseEnterValidNumber
source: Please enter a valid number
be: Калі ласка, увядзіце дапушчальны лік
pl: Proszę podać prawidłową liczbę

# fieldRequired
source: This field is required
be: Гэта поле абавязковае
pl: To pole jest wymagane

source: Value must be non-negative
be: Значэнне павінна быць неадмоўным
pl: Wartość musi być nieujemna

# leaveEmptyForHomemade
source: Leave empty for homemade items
be: Пакіньце пустым для хатніх прадуктаў
pl: Pozostaw puste dla produktów domowych

# additionalInformation
source: Additional information about this product
be: Дадатковая інфармацыя пра гэты прадукт
pl: Dodatkowe informacje o tym produkcie

source: Delete Product
be: Выдаліць прадукт
pl: Usuń produkt

# deleteProductConfirmation
source: Are you sure you want to delete "{productName}"?
be: Вы ўпэўнены, што хочаце выдаліць "{productName}"?
pl: Czy na pewno chcesz usunąć "{productName}"?

# productNotFoundDialog
source: Product Not Found
be: Прадукт не знойдзены
pl: Produkt nie znaleziony

# noProductFoundWithBarcode
source: No product found with barcode: {barcode}
be: Прадукт са штрых-кодам {barcode} не знойдзены
pl: Nie znaleziono produktu z kodem kreskowym: {barcode}

# createCustomProductPrompt
source: Would you like to create a custom product with this barcode?
be: Хочаце стварыць карыстальніцкі прадукт з гэтым штрых-кодам?
pl: Czy chcesz utworzyć własny produkt z tym kodem kreskowym?

source: Goals updated successfully
be: Мэты паспяхова абноўлены
pl: Cele zostały pomyślnie zaktualizowane

# addedProductToMeal
source: Added {productName} to {mealType}
be: Дададзены {productName} да {mealType}
pl: Dodano {productName} do {mealType}

source: Product created successfully
be: Прадукт паспяхова створаны
pl: Produkt został pomyślnie utworzony

source: Product updated successfully
be: Прадукт паспяхова абноўлены
pl: Produkt został pomyślnie zaktualizowany

# errorLoadingProduct
source: Error loading product: {error}
be: Памылка загрузкі прадукту: {error}
pl: Błąd ładowania produktu: {error}

source: Loading product...
be: Загрузка прадукту...
pl: Ładowanie produktu...

source: Appearance
be: Знешні выгляд
pl: Wygląd

source: Data Management
be: Кіраванне данымі
pl: Zarządzanie danymi

source: About
be: Пра праграму
pl: O aplikacji

source: Language
be: Мова
pl: Język

source: Choose Language
be: Выбраць мову
pl: Wybierz język

source: System Default
be: Сістэмны па змаўчанні
pl: Domyślny systemu

source: Theme
be: Тэма
pl: Motyw

source: Choose Theme
be: Выбраць тэму
pl: Wybierz motyw

source: Light Theme
be: Светлая тэма
pl: Jasny motyw

source: Dark Theme
be: Цёмная тэма
pl: Ciemny motyw

source: Clear Frequent Products Cache
be: Ачысціць кэш часта выкарыстоўваных прадуктаў
pl: Wyczyść pamięć podręczną często używanych produktów

# clearFrequentProductsDescription
source: Remove all frequently used products history
be: Выдаліць усю гісторыю часта выкарыстоўваных прадуктаў
pl: Usuń całą historię często używanych produktów

source: Clear Cache
be: Ачысціць кэш
pl: Wyczyść pamięć podręczną

# clearCacheConfirmation
source: Are you sure you want to clear your frequent products cache? This will remove all usage history.
be: Вы ўпэўнены, што хочаце ачысціць кэш часта выкарыстоўваных прадуктаў? Гэта выдаліць усю гісторыю выкарыстання.
pl: Czy na pewno chcesz wyczyścić pamięć podręczną często używanych produktów? Spowoduje to usunięcie całej historii użycia.

source: Cache cleared
be: Кэш ачышчаны
pl: Pamięć podręczna wyczyszczona

source: App Version
be: Версія праграмы
pl: Wersja aplikacji

source: Loading...
be: Загрузка...
pl: Ładowanie...

# appDescription
source: A food diary app to track your daily nutrition and reach your goals.
be: Праграма для вядзення дзённіка харчавання, адсочвання штодзённага рацыёну і дасягнення вашых мэтаў.
pl: Aplikacja dziennika żywieniowego do śledzenia codziennego odżywiania i osiągania celów.

# openFoodFactsAttribution
source: Product data provided by Open Food Facts
be: Дадзеныя пра прадукты прадастаўлены Open Food Facts
pl: Dane o produktach dostarczone przez Open Food Facts

# openFoodFactsDescription
source: This app uses product data from Open Food Facts, a free and open database of food products from around the world.
be: Гэтая праграма выкарыстоўвае дадзеныя пра прадукты з Open Food Facts, бясплатнай і адкрытай базы дадзеных прадуктаў харчавання з усяго свету.
pl: Ta aplikacja wykorzystuje dane o produktach z Open Food Facts, darmowej i otwartej bazy danych produktów spożywczych z całego świata.

source: Today
be: Сёння
pl: Dzisiaj

source: Week
be: Тыдзень
pl: Tydzień

source: Loading charts...
be: Загрузка графікаў...
pl: Ładowanie wykresów...

source: Weekly Calorie Trend
be: Штотыднёвая тэндэнцыя калорый
pl: Tygodniowy trend kalorii

source: Last 7 days
be: Апошнія 7 дзён
pl: Ostatnie 7 dni

source: Today's Macro Breakdown
be: Размеркаванне макранутрыентаў сёння
pl: Dzisiejszy rozkład makroskładników

source: No macro data for today
be: Няма дадзеных пра макранутрыенты за сёння
pl: Brak danych o makroskładnikach na dzisiaj

# addSomeFoodToSeeMacros
source: Add some food to see your macro breakdown
be: Дадайце ежу, каб убачыць размеркаванне макранутрыентаў
pl: Dodaj jedzenie, aby zobaczyć rozkład makroskładników

# itemCount
source: {count} {count, plural, =1{item} other{items}}
be: {count} {count, plural, =1{элемент} few{элементы} other{элементаў}}
pl: {count} {count, plural, =1{element} few{elementy} other{elementów}}

# pointCameraAtBarcode
source: Point your camera at a barcode to scan
be: Накіруйце камеру на штрых-код для сканавання
pl: Skieruj aparat na kod kreskowy, aby zeskanować

source: Error
be: Памылка
pl: Błąd

# unknownError
source: An unknown error occurred
be: Адбылася невядомая памылка
pl: Wystąpił nieznany błąd

source: Meal Type
be: Тып прыёму ежы
pl: Typ posiłku

source: Notes
be: Нататкі
pl: Notatki

source: Image
be: Выява
pl: Obraz

source: Change Image
be: Змяніць выяву
pl: Zmień obraz

source: Add Image
be: Дадаць выяву
pl: Dodaj obraz

# failedToLoadChartData
source: Failed to load chart data: {error}
be: Не ўдалося загрузіць дадзеныя графіка: {error}
pl: Nie udało się załadować danych wykresu: {error}

source: No data available
be: Няма даступных дадзеных
pl: Brak dostępnych danych

source: Weekly Macro Trends
be: Штотыднёвыя тэндэнцыі макранутрыентаў
pl: Tygodniowe trendy makroskładników

source: Protein, Fat & Carbs (grams)
be: Бялкі, тлушчы і вугляводы (грамы)
pl: Białko, tłuszcze i węglowodany (gramy)

# errorPickingImage
source: Error picking image: {error}
be: Памылка выбару выявы: {error}
pl: Błąd wybierania obrazu: {error}

source: Select Image Source
be: Выбраць крыніцу выявы
pl: Wybierz źródło obrazu

source: Camera
be: Камера
pl: Aparat

source: Gallery
be: Галерэя
pl: Galeria

# errorSavingProduct
source: Error saving product: {error}
be: Памылка захавання прадукту: {error}
pl: Błąd zapisywania produktu: {error}

source: Add Photo
be: Дадаць фота
pl: Dodaj zdjęcie

# caloriesKcalRequired
source: Calories (kcal) *
be: Калорыі (ккал) *
pl: Kalorie (kcal) *

# proteinGramsRequired
source: Protein (g) *
be: Бялкі (г) *
pl: Białko (g) *

# fatGramsRequired
source: Fat (g) *
be: Тлушчы (г) *
pl: Tłuszcze (g) *

# carbohydratesGramsRequired
source: Carbohydrates (g) *
be: Вугляводы (г) *
pl: Węglowodany (g) *

# errorLoadingProducts
source: Error loading products: {error}
be: Памылка загрузкі прадуктаў: {error}
pl: Błąd ładowania produktów: {error}

source: Product deleted
be: Прадукт выдалены
pl: Produkt usunięty

# errorDeletingProduct
source: Error deleting product: {error}
be: Памылка выдалення прадукту: {error}
pl: Błąd usuwania produktu: {error}

# kcalPer100g
source: {calories} kcal per 100g
be: {calories} ккал на 100г
pl: {calories} kcal na 100g

source: Custom
be: Карыстальніцкі
pl: Własny

# goalsRecommendation
source: These goals are general recommendations. Consult a nutritionist for personalized advice.
be: Гэтыя мэты з'яўляюцца агульнымі рэкамендацыямі. Пракансультуйцеся з дыетолагам для атрымання індывідуальных рэкамендацый.
pl: Te cele są ogólnymi zaleceniami. Skonsultuj się z dietetykiem, aby uzyskać spersonalizowane porady.

# failedToFetchProduct
source: Failed to fetch product: {error}
be: Не ўдалося атрымаць прадукт: {error}
pl: Nie udało się pobrać produktu: {error}

# errorSearching
source: Error searching: {error}
be: Памылка пошуку: {error}
pl: Błąd wyszukiwania: {error}

source: Export Diary Entries
be: Экспарт запісаў дзённіка
pl: Eksportuj wpisy dziennika

# exportDiaryEntriesDescription
source: Export your food diary to CSV format
be: Экспартаваць дзённік харчавання ў фармат CSV або JSON
pl: Eksportuj dziennik żywieniowy do formatu CSV

source: Exporting data...
be: Экспарт дадзеных...
pl: Eksportowanie danych...

# exportSuccess
source: Diary exported successfully!
be: Дзённік паспяхова экспартаваны!
pl: Dziennik wyeksportowany pomyślnie!

# exportError
source: Failed to export data
be: Не ўдалося экспартаваць дадзеныя
pl: Nie udało się wyeksportować danych

# noDataToExport
source: No diary entries to export
be: Няма запісаў дзённіка для экспарту
pl: Brak wpisów dziennika do eksportu

source: Select Export Timeframe
pl: Wybierz okres eksportu

source: All Time
pl: Cały czas

# exportAllEntries
source: Export all diary entries
pl: Eksportuj wszystkie wpisy dziennika

# exportLast7Days
source: Export entries from the last 7 days
pl: Eksportuj wpisy z ostatnich 7 dni

source: Last 30 Days
pl: Ostatnie 30 dni

# exportLast30Days
source: Export entries from the last 30 days
pl: Eksportuj wpisy z ostatnich 30 dni

source: Export Products
be: Экспартаваць прадукты
pl: Eksportuj Produkty

# exportProductsDescription
source: Export your local products to JSON format
be: Экспартуйце свае лакальныя прадукты ў фармат JSON
pl: Eksportuj swoje lokalne produkty do formatu JSON

# exportProductsSuccess
source: Products exported successfully!
be: Прадукты паспяхова экспартаваны!
pl: Produkty wyeksportowane pomyślnie!

# noProductsToExport
source: No local products to export
be: Няма лакальных прадуктаў для экспарту
pl: Brak lokalnych produktów do eksportu

source: Import Products
be: Імпартаваць прадукты
pl: Importuj Produkty

# importProductsDescription
source: Import products from a JSON file
be: Імпартаваць прадукты з файла JSON
pl: Importuj produkty z pliku JSON

source: Importing Products
be: Імпарт прадуктаў
pl: Importowanie Produktów

# importingProductsProgress
source: Importing {current} of {total} products...
be: Імпартаванне {current} з {total} прадуктаў...
pl: Importowanie {current} z {total} produktów...

source: Import Complete
be: Імпарт завершаны
pl: Import Zakończony

# importError
source: Import failed
be: Памылка імпарту
pl: Błąd importu

source: Imported
be: Імпартавана
pl: Zaimportowano

source: Skipped
be: Прапушчана
pl: Pominięto

source: Errors
be: Памылкі
pl: Błędy

source: Error Details
be: Дэталі памылкі
pl: Szczegóły Błędu

source: Close
be: Зачыніць
pl: Zamknij

# productConflictTitle
source: Product Conflict
be: Канфлікт прадуктаў
pl: Konflikt Produktu

# productConflictMessage
source: A product with this barcode already exists. What would you like to do?
be: Прадукт з гэтым штрых-кодам ужо існуе. Што вы хочаце зрабіць?
pl: Produkt z tym kodem kreskowym już istnieje. Co chcesz zrobić?

# existingProduct
source: Existing
be: Існуючы
pl: Istniejący

source: Keep Existing
be: Пакінуць існуючы
pl: Zachowaj Istniejący

# replaceWithImport
source: Replace
be: Замяніць
pl: Zamień

source: Keep All Remaining
be: Пакінуць усе астатнія
pl: Zachowaj Wszystkie Pozostałe

source: Replace All Remaining
be: Замяніць усе астатнія
pl: Zamień Wszystkie Pozostałe

source: Product Details
be: Дэталі прадукту
pl: Szczegóły Produktu

source: Barcode
be: Штрых-код
pl: Kod Kreskowy

# basedOnOffProduct
source: Based on OpenFoodFacts product
be: На аснове прадукту OpenFoodFacts
pl: Na podstawie produktu OpenFoodFacts

source: kcal
be: ккал

# grams
source: g
be: г

source: OK
be: ОК

# importedProduct
source: Import
be: Імпарт
